ShifengHuGit/CanBusPower/boards/ek-lm3s8962/CanVW/CanTest.c
}
void
CANConfigureNetwork(void)
{
    //
    // This is the message object used to send button updates.  This message
    // object will not be "set" right now as that would trigger a transmission.
    //
    CanMsg_SessionCtl_TX.ulMsgID = CANMSGID_TESTER_SESSION;
    CanMsg_SessionCtl_TX.ulMsgIDMask = 0;
    CanMsg_SessionCtl_TX.ulFlags = MSG_OBJ_TX_INT_ENABLE;
    CanMsg_SessionCtl_TX.ulMsgLen = 8;
    //CanMsg_SessionCtl_TX.pucMsgData = SessionFrameTX;

    CanMsg_SessionCtl_RX.ulMsgID = CANMSGID_ECU_SESSION;
    CanMsg_SessionCtl_RX.ulMsgIDMask = 0x7FF;
    CanMsg_SessionCtl_RX.ulFlags = MSG_OBJ_RX_INT_ENABLE|MSG_OBJ_USE_ID_FILTER;
    CanMsg_SessionCtl_RX.ulMsgLen = 8;
    CANMessageSet(CAN0_BASE, MSGOBJ_SES_CTRL, &CanMsg_SessionCtl_RX,
                  MSG_OBJ_TYPE_RX);


    }

void
ProcessCmd(void)
{
    volatile unsigned long ulLoop;
    volatile unsigned char Keepalive[] = {0x02,0x3E,0x80,0x55,0x55,0x55,0x55,0x55};
    //Data area is fixed to 0~64bit
    unsigned char pucData[8]; 
    int Datalen =0 ;
    int i=0;
    int NoSingleFrame;
    //unsigned char RawData[16]={"abcdefghijklmnop"};
    unsigned char RespFlag; 
    unsigned char RespSIDCode, RespLength;
    unsigned long RespData = 0; 
    unsigned long FunctionCode;
    char HEX_RespFlag[2];
    char HEX_RespSIDCode[2];
    char HEX_RespData[16];
    char HEX_FunctionCode[4];
    char HEX_RespLength[2];
    char HEX_RawData[16];
    char DisplayBuf[24];
   



  switch(g_ulFlags)
    {
        //
        // Let the forground loop handle sending this, just set a flag to
        // indicate that the data should be sent.
        //
        case MSGOBJ_SES_CTRL:
        {
            //
            // Indicate a pending button transmission is complete.
            //
            g_ulFlags &= (~FLAG_RX_SES_CTRL);

            break;
        }
        case MSGOBJ_NUM_BUTTON:
        {
            //
            // Indicate a pending button transmission is complete.
            //
            g_ulFlags &= (~FLAG_BUTTON_PEND);

            break;
        }
/*----LED
        case MSGOBJ_NUM_LED:
        {
            //
            // Read the new LED level and let the foreground handle it.
            //
            CANMessageGet(CAN0_BASE, MSGOBJ_NUM_LED, &g_MsgObjectLED, 1);

            //
            // Limit the LED Level to MAX_LED_BRIGHTNESS.
            //
            if((g_ucLEDLevel & LED_FLASH_VALUE_MASK) > MAX_LED_BRIGHTNESS)
            {
                g_ucLEDLevel = MAX_LED_BRIGHTNESS |
                               (g_ucLEDLevel & LED_FLASH_ONCE);
            }

            //
            // Indicate that the LED needs to be updated.
            //
            g_ulFlags |= FLAG_UPDATE_LED;

            break;
        }
----*/
        //
        // The data transmit message object has been sent successfully.
        //
        case MSGOBJ_NUM_DATA_TX:
        {
            //
            // Clear the data transmit pending flag.
            //
            g_ulFlags &= (~FLAG_DATA_TX_PEND);
            break;
        }

        //
        // The data receive message object has received some data.
        //
        case MSGOBJ_NUM_DATA_RX:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_DATA_RECV;
            break;
        }
        case MSGOBJ_ENG_STATUS:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_ENG_STATUS;
            break;
        }
        case MSGOBJ_ENG_RPM:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_ENG_RPM;
            break;
        }
        case MSGOBJ_ENG_WORKLOAD:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_ENG_WORKLOAD;
            break;
        }
        case MSGOBJ_ENG_MILE:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_ENG_MILE;
            break;
        }
        case MSGOBJ_ENG_TURBO:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_ENG_TURBO;
            break;
        }
        case MSGOBJ_ENG_OILLEVEL:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_ENG_OILLEVEL;
            break;
        }
        case MSGOBJ_ENG_THROLLTEPOSITION:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_ENG_THROLLTEPOSITION;
            break;
        }
        case MSGOBJ_ENG_COOLTEMP:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_ENG_COOLTEMP;
            break;
        }
        case MSGOBJ_GBX_SHIFTPOSITION:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_GBX_SHIFTPOSITION;
            break;
        }
        case MSGOBJ_GPS_ATT:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_GPS_ATT;
            break;
        }
        case MSGOBJ_GPS_LONG:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_GPS_LONG;
            break;
        }
        case MSGOBJ_GPS_SETLNUM:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_GPS_SETLNUM;
            break;
        }
        case MSGOBJ_GPS_SETLTRACKED:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_GPS_SETLTRACKED;
            break;
        }
        case MSGOBJ_AIR_INSIDETEMP:
        {
            //
            // Indicate that the data message object has new data.
            //
            g_ulFlags |= FLAG_RX_AIR_INSIDETEMP;
            break;
        }
       
        // This was a status interrupt so read the current status to
        // clear the interrupt and return.
        //
        default:
        {
            CANStatusGet(CAN0_BASE, CAN_STS_CONTROL);
            return;
        }
    }



    g_MsgObjectRx.pucMsgData = pucData;
    g_MsgObjectRx.ulMsgLen = 8;
    CANMessageGet(CAN0_BASE, MSGOBJ_NUM_DATA_RX, &g_MsgObjectRx, 1);

    
    // There are a lots of traffice go through the bus, what I really dont what it is , and it's not useful for now
    // Exclude those frame by the MsgID
    // Currently I dont want to have :
    // --- 0x0007B4
    // --- 0x0007B5
    // --- 0x17F00010
    if((g_MsgObjectRx.ulMsgID != 0x0007B4 ) && (g_MsgObjectRx.ulMsgID != 0x0007B5 ) && 
    (g_MsgObjectRx.ulMsgID != 0x17F00010))
    {
        // Filter the Heartbeat frame, if it is HB frame, sub function will direct return.
        for(Datalen=0; Datalen<g_MsgObjectRx.ulMsgLen; Datalen++)
        {
            /* Also Ignore the Heartbeat Frame sent from the Tester */
            if(g_MsgObjectRx.pucMsgData[Datalen] == Keepalive[Datalen])
            {
                Datalen++;
                if (Datalen == 7)
                { 
                    //This is a Keepalive data , ignore.
                    g_ulFlags &= (~FLAG_DATA_RECV);
                    GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, 0);
                    return;
                }
            }
            else
            {
                break;
            }
         }   
          
