ShifengHuGit/CanBusPower/boards/ek-lm3s8962/CanVW/CanTest.c
        UARTSend((unsigned char *)"ID |", 4);
        UARTSend((unsigned char *)&(g_MsgObjectRx.ulMsgID), 4);
        UARTSend((unsigned char *)"--DATA |", 8);
        UARTSend((unsigned char *)g_MsgObjectRx.pucMsgData, 8);

       /*---
       USD stuff:
        [ byte0 byte1 byte2 byte3 byte4 byte5 byte6 byte7 ] 
                 |    SID : We only use 0x22 Operation, to get the ECU value by identifyID.
                 |->  0x22 :                In Request
                 |->  Value + 0x40 :        In Response : OK! Good,(our case, 0x62)
                 |->  0x7F :                In Response : FxxK, you can't have me, said by ECU and with NRC.
              
        ------*/ 
       RespSIDCode =  g_MsgObjectRx.pucMsgData[1];
       if(RespSIDCode == 0x7f  || RespSIDCode != 0x62 )
       {
            WRCommandH(0x01);
            //WRCommandH(0x20);
            ShowQQCharH(0x80, "??????SID ", 6);
           //This is rejected by ECU, ignore this frame for this time
           g_ulFlags &= (~FLAG_DATA_RECV);
           GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, 0);
           return;
       }

        /*---
         USD stuff:
         [ byte0      byte1 byte2 byte3 byte4 byte5 byte6 byte7 ] 
         [ bXXXX XXXX byte1 byte2 byte3 byte4 byte5 byte6 byte7 ]
            |
            |->  Single Frame :        0x0X
            |->  FristFrame :          0x1X
            |->  Continue Frame :      0x2X
            |->  Flow Control :        0x3X
        ------*/ 
        RespFlag =  g_MsgObjectRx.pucMsgData[0] & 0xF0;
        if((RespFlag & 0x0F) >>4)
           NoSingleFrame = 1;
         /*---
          USD stuff:
          [ byte0      byte1 byte2 byte3 byte4 byte5 byte6 byte7 ] 
          [ bXXXX XXXX byte1 byte2 byte3 byte4 byte5 byte6 byte7 ] 
                   |
                   |->  Size of data inside this frame, after the 1st byte:
         ------*/ 
         //   { 0x05,0x62, 0xf4, 0x0c,0x0a,0xf9, 0xaa, 0xaa};
        RespLength =  g_MsgObjectRx.pucMsgData[0] & 0x0F;
        for(i=4; i<=RespLength; i++){
              RespData |= g_MsgObjectRx.pucMsgData[i];
              if(i != RespLength ) 
                { 
                    RespData <<=8;
                }
              else
              {
                  break;
              }
              

        }
        /*---
        USD stuff:
        [ byte0 byte1 byte2 byte3 byte4 byte5 byte6 byte7 ] 
                        |    
                        |->  Byte2 and 3 are the function code, and 
                        |->  the Data in the Response frame after Byte3.
                        |->  its length was decided by the byte0 low 4 digitals
         ------*/ 
        FunctionCode = g_MsgObjectRx.pucMsgData[2]<<8|g_MsgObjectRx.pucMsgData[3];

          /*---------------------------------------------------------------------------
              1    2    3    4    5   6    7    8     9   10   11   12
          H 0x80 0x81 0x82 0x83 0x84 0x85 0x86 0x87 0x88 0x89 0x8A 0x8B
             ??   ??    : 
          H 0x90 0x91 0x92 0x93 0x94 0x95 0x96 0x97 0x98 0x99 0x9A 0x9B
             FL   ag    :    X   Le   n:    X    D:  X     X
          L 0x80 0x81 0x82 0x83 0x84 0x85 0x86 0x87 0x88 0x89 0x8A 0x8B
             Fu   nc    ti   on  Co   de
          L 0x90 0x91 0x92 0x93 0x94 0x95 0x96 0x97 0x98 0x99 0x9A 0x9B
          ---------------------------------------------------------------------------*/
/*
    switch(FunctionCode){
        case RPM_CODE: 
        case ENGINE_STATUS_CODE:
        case ENGINE_WORKLOAD_PRECENTAGE:
        case SHIFT_GEAR_POSITION:
        case TURBO_PRESSURE:
        case THROTTLE_PRECENTAGE:
        default: break;

    }
*/   
       

        usprintf(DisplayBuf, "Flag is:%02X, Size is:%02X", RespFlag, RespLength);
        ShowQQCharH(0x80, (unsigned char *)DisplayBuf,11);
        memset(DisplayBuf, 0, 24);
        usprintf(DisplayBuf, "Data: %X", RespData);
        ShowQQCharL(0x80, (unsigned char *)DisplayBuf,6);
        memset(DisplayBuf, 0, 24);
        usprintf(DisplayBuf, "FunctionCode: %4X", FunctionCode);
        ShowQQCharL(0x90, (unsigned char *)DisplayBuf,9);
        memset(DisplayBuf, 0, 24);

       //to_hex((char *)g_MsgObjectRx.pucMsgData,8, HEX_RawData);
       //to_hex((char *)&RespFlag,               1, HEX_RespFlag);
       //to_hex((char *)&RespLength,             1, HEX_RespLength);
       //to_hex((char *)&RespData,               (int)RespLength-3,  HEX_RespData);
       //to_hex((char *)&FunctionCode,           2, HEX_FunctionCode);
//
       // ShowQQCharH(0x80, "????: ", 3); 
        //WRCommandH(0x20);
        //ShowQQCharH(0x84, (unsigned char *)HEX_RawData,8);

        //ShowQQCharH(0x80, "Flag: ", 3);
        //WRCommandH(0x01);
        //WRCommandH(0x20);
        //ShowQQCharH(0x80, (unsigned char *)HEX_RespFlag,1);
        //ShowNUMCharH(0x80, g_MsgObjectRx.pucMsgData[0], 1 );
        //ShowAlphabet(0x80, (unsigned char *)"0x31323334", 4);
        
        //ShowQQCharH(0x90, "Len:", 2);
        //ShowQQCharH(0x90, (unsigned char *)HEX_RespLength,1);

        //ShowQQCharL(0x80, "Data: ", 3);
       ///WRCommandH(0x20);
       // ShowQQCharL(0x80, (unsigned char *)HEX_RespData,RespLength-3);
//
        //ShowQQCharL(0x90, "FunctionCode", 6);
       //WRCommandH(0x20);
        //ShowQQCharL(0x90, (unsigned char *)HEX_FunctionCode,2);
         
        //ShowQQCharH(0x93, (unsigned char *)HEX_RespFlag,1);
        //ShowQQCharH(0x96, (unsigned char *)HEX_RespLength,1);
        //ShowQQCharH(0x98, (unsigned char *)HEX_RespData,RespLength-3);
        //ShowQQCharL(0x87, (unsigned char *)HEX_FunctionCode,2);

          //UARTSend((unsigned char *)"ID |", 4);
          //UARTSend((unsigned char *)&(g_MsgObjectRx.ulMsgID), 4);
          //UARTSend((unsigned char *)"--DATA |", 8);
          //UARTSend((unsigned char *)g_MsgObjectRx.pucMsgData, 8);
          //WaitNms(200);
    }

    //
    // Clear the flag to indicate that the data has been read.
    //
    g_ulFlags &= (~FLAG_DATA_RECV);
    for(ulLoop = 0; ulLoop < 50000; ulLoop++)
    {
    }
    GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, 0);
}

int ECU_Session_setup(){
    //CanID-??10 07?? Can Data->?? 02-|10 03 55 55 55 55 55 |]  
    unsigned char SessionFrameTX[8] = {0x02, 0x10, 0x03, 0x55, 0x55,0x55,0x55,0x55};
    unsigned char SessionFrameRX[8];
    unsigned char RespFlag; 
    unsigned char RespSIDCode, RespLength;
    unsigned long RespData = 0; 
    unsigned long FunctionCode; 

    CanMsg_SessionCtl_TX.pucMsgData = SessionFrameTX;
    CANMessageSet(CAN0_BASE, MSGOBJ_NUM_DATA_TX, &CanMsg_SessionCtl_TX,
                          MSG_OBJ_TYPE_TX);
   // UARTSend((unsigned char *)"-------Wait 4 Interrupt!---------", 33);
  while(g_ulFlags != FLAG_RX_SES_CTRL)
  { 
     
