ShifengHuGit/CanBusPower/boards/ek-lm3s8962/CanVW/CanTest.c
  }

CanMsg_SessionCtl_RX.pucMsgData = SessionFrameRX;
CanMsg_SessionCtl_RX.ulMsgLen = 8;
CANMessageGet(CAN0_BASE, MSGOBJ_SES_CTRL, &CanMsg_SessionCtl_RX, 1);
//  
// UARTSend((unsigned char *)"ID |", 4);
// UARTSend((unsigned char *)&(CanMsg_SessionCtl_RX.ulMsgID), 4);
// UARTSend((unsigned char *)"--DATA |", 8);
 UARTSend((unsigned char *)CanMsg_SessionCtl_RX.pucMsgData, 8);
//
//
 //RespSIDCode =  CanMsg_SessionCtl_RX.pucMsgData[1];
 if(CanMsg_SessionCtl_RX.pucMsgData[0] == 0x7f 
      || CanMsg_SessionCtl_RX.pucMsgData[1] != 0x50
       || CanMsg_SessionCtl_RX.pucMsgData[2] != 0x03  )
 {
     //UARTSend("Initial Session setup failed!", 29);
     return 1;
 }
 else
 {
     //UARTSend("Initial Session setup Succeed!", 30);
     return 0;
 }
//  

    g_ulFlags &= (~FLAG_RX_SES_CTRL);

}



int main(void)
{
    int r ;
    //Set clock
    SysCtlClockSet(SYSCTL_SYSDIV_8 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN |
           SYSCTL_XTAL_8MHZ);
    //Enable JTAG
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
    GPIOPadConfigSet(GPIO_PORTC_BASE,
                     GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3,
                     GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);
    
    //LCD use GPIO
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    GPIOPinTypeGPIOOutput(GPIO_PORTC_BASE, GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7);
    GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, GPIO_PIN_0 );
    
    LCDInit();
    
    //WRCommandL(0x01);
    
    //WRCommandH(0x20);
   
    //Enable CAN
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
    GPIOPinTypeCAN(GPIO_PORTD_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    
    //
    // Enable the CAN controller.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_CAN0);

    //Enable UART0
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    UARTConfigSetExpClk(UART0_BASE, SysCtlClockGet(), 115200,
                        (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
                         UART_CONFIG_PAR_NONE));
    UARTFIFODisable(UART0_BASE); 
    UARTSend((unsigned char *)"-------This is the CanBoard!-----", 33);
     

    //Enable LED
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
    GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_2);


    //Enable CAN Interrupt
    CANInit(CAN0_BASE);

    //
    // Configure the bit clock parameters for the CAN device.
    //
    CANBitTimingSet(CAN0_BASE, &CANBitClkSettings[CANBAUD_500K]);

    //
    // Take the CAN0 device out of INIT state.
    //
    CANEnable(CAN0_BASE);

    //
    // Enable interrups from CAN controller.
    //
    CANIntEnable(CAN0_BASE, CAN_INT_MASTER | CAN_INT_ERROR);
    
    CANConfigureNetwork();
    IntEnable(INT_CAN0);
    IntMasterEnable();

    SysTickPeriodSet(SysCtlClockGet() / 100);
    SysTickEnable();
    SysTickIntEnable();

    GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, GPIO_PIN_2);

   r = ECU_Session_setup();
   
    ShowQQCharH(0x80, "----Volkswagen-Power----", 12);
   
   
    while(1)
    {
       if(r)
        {
            ShowQQCharL(0x80, "-----Session Failed-----", 12);
        }
        else 
        {
            ShowQQCharL(0x80, "-----Session   OK  -----", 12);
        }

    }

}
